/******************************************************************************/
/*               (C) 斯凯瑞利（北京）科技有限公司(SKYRELAY)                   */
/*                                                                            */
/* 此代码是斯凯瑞利（北京）科技有限公司为支持客户编写的示例程序的一部分       */
/* 所有使用斯凯瑞利相关芯片的用户可以无偿使用该代码，但需保留本声明部分       */
/* 本代码仅为演示使用，不保证符合所有的应用要求，当有特定规范或需求时，       */
/* 使用者需自行确认代码是否符合要求，不合要求时自行做出相应的修改。           */
/* (V1.00)                                                                    */
/******************************************************************************/
/**
 ******************************************************************************
 ** 文 件 名： driver.c
 **
 ** 文件简述： 底层驱动抽象函数，包括GPIO，UART和SPI通信接口，定时器和ADC有关的
 **            函数和变量。衔接底层驱动和应用程序的中介。
 **
 ** 版本历史:
 ** 2015-10-05 V1.00  EH   第一个正式版本
 **
 ******************************************************************************/
#include "mcu.h"
#include "sky1311s.h"
/**
 ******************************************************************************
 ** \简  述  拉高sky1311的PD2引脚，使能sky1311
 **
 ** \参  数  none
 ** \返回值  none
 ******************************************************************************/
/*void sky1311Enable(void)
{
    PD = 1;
}*/
/**
 ******************************************************************************
 ** \简  述  拉低sky1311的PD2引脚，禁止sky1311
 **
 ** \参  数  none
 ** \返回值  none
 ******************************************************************************/
/*void sky1311Disable(void)
{
    PD = 0;
}*/
 
/**
 ******************************************************************************
 ** \简  述  通过SPI接口向1311写一个字节的命令
 **
 ** \参  数  命令字
 ** \返回值  none
 ******************************************************************************/
void sky1311WriteCmd(u8 cmd)
{
    volatile u8 dummy=10;
    SPI_CS = 0;
	cmd = (cmd & 0x1F) | 0x80;	// bit7,6,5 = 100b, mean command
	SpiWriteByte(cmd);			// cmd write to sky1311 (SPI MFS4_CSIO)
	while(dummy--);
	SPI_CS = 1;
    
}
/**
 ******************************************************************************
 ** \简  述  通过SPI接口向1311的寄存器写一个字节数据
 **
 ** \参  数  u8 regAdd: 寄存器地址， u8 data: 要写入的数据
 ** \返回值  none
 ******************************************************************************/
void sky1311WriteReg(u8 regAdd, u8 data)
{
    volatile u8 dummy=10;
    SPI_CS = 0;                                       // CS signal enable
    regAdd      =   (regAdd & 0x3F);                  // bit7,6=00, config as addr/write mode
    SpiWriteByte(regAdd);
    SpiWriteByte(data);
    while(dummy--);
    SPI_CS = 1;                                        // CS signal disabled
}
/**
 ******************************************************************************
 ** \简  述  通过SPI接口读取1311的寄存器
 **
 ** \参  数  u8 regAdd: 寄存器地址
 ** \返回值  u8 寄存器内容
 ******************************************************************************/
u8 sky1311ReadReg(u8 regAdd)
{
    u8 data;
    SPI_CS = 0;                                        // CS signal enable
    regAdd      =   (regAdd & 0x3F) | 0x40;            // bit7,6=01, config as addr/read mode
    SpiWriteByte(regAdd);
    data = SpiReadByte();                              // send another 8 bit while receiving data
    SPI_CS = 1;                                        // CS signal disabled
    return data;
}
/**
 ******************************************************************************
 ** \简  述  通过SPI接口向1311的FIFO写指定数目的数据
 **
 ** \参  数  u8* 数据内容头地址， u8 count: 要写入的数据数量
 ** \返回值  none
 ******************************************************************************/
void sky1311WriteFifo(u8 *data, u8 count)       
{
    u8 add;
    volatile u8 dummy=10;
    SPI_CS = 0;                                       // CS signal enable
    add      =   (ADDR_FIFO & 0x3F);               // bit7,6=00, config as addr/write mode
    SpiWriteByte(add);
    while(count--){
        SpiWriteByte(*data++);    
    }
    while(dummy--);
    SPI_CS = 1;                                        // CS signal disabled
}
/**
 ******************************************************************************
 ** \简  述  通过SPI接口向1311的FIFO读取指定数目的内容
 **
 ** \参  数  u8* data 保存读取内容的缓冲区首地址， u8 count 读取的字节数
 ** \返回值  none
 ******************************************************************************/
void sky1311ReadFifo(u8 *data, u8 count)   
{
    u8 add;
    SPI_CS = 0;                                        // CS signal enable
    add   =   (ADDR_FIFO & 0x3F) | 0x40;            // bit7,6=01, config as addr/read mode
    SpiWriteByte(add);
    while(count--){
        *data++ = SpiReadByte();    
    }
    SPI_CS = 1;                                       // CS signal disabled
}
